from Lab_2.Zadacha3 import decrypt

test_cases = [
    ("абра-кадабра.", "абра-кадабра"),
    ("абраа..-кадабра", "абра-кадабра"),
    ("абраа..-.кадабра", "абра-кадабра"),
    ("абра--..кадабра", "абра-кадабра"),
    ("абрау...-кадабра", "абра-кадабра"),
    ("абра........", ""),
    ("абр......a.", "a"),
    ("1..2.3", "23"),
    (".", ""),
    ("1.......................", ""),
]

for encrypted, expected in test_cases:
    assert decrypt(encrypted) == expected, f"{encrypted} → {decrypt(encrypted)} (ожидалось {expected})"
print("Все тесты пройдены!")